{
  "home": {
    "hello": {
      "prefix": "Hello, I am",
      "suffix": ""
    },
    "name": "Hanbong Bae",
    "position": "a Backend Developer.",
    "about": {
      "content": "I have honed diverse skills across various companies, enhancing my expertise in backend development.",
      "button": "Discover More"
    },
    "projects": {
      "content": "I have successfully spearheaded numerous projects with remarkable outcomes. Want to see the details?",
      "button": "View My Work"
    },
    "contact": {
      "content": "Looking for a developer or need help with a project? Let's get in touch!",
      "button": "Reach Out"
    }
  },
  "about": {
    "description": "I am a software developer with 5 years of experience specializing in backend web services within startup environments. I excel in backend API development using Spring Boot and managing Linux servers. Known for my rapid development and debugging skills, I consistently meet challenging deadlines and deliver reliable, high-quality results. My ability to adapt and grow in fast-paced environments, coupled with my continuous learning and deep understanding of the latest technological trends, enables me to effectively solve complex problems. My technical skill set includes Java, Spring, MySQL, AWS services, and Spring Batch, with a strong focus on SQL query optimization. I have successfully led multiple projects with agile project management and demonstrated my ability to work effectively in team environments.",
    "experience": "I have honed my skills working at various companies and collaborating with outstanding individuals.",
    "list": [
      {
        "name": "Wecruit Co., Ltd.",
        "points": [
          "Applied Bean-based dynamic configuration for Indonesian overseas services, enabling flexible external API calls and cost reduction.",
          "Conducted load testing for Open API service stability, optimized Connection Pool, and eliminated deadlocks.",
          "Minimized transaction scope to reduce unnecessary usage, improving performance and resource efficiency.",
          "Enhanced data processing speed by 200% through Spring Batch Writer modification.",
          "Migrated to a cloud environment for cost reduction (GCP -> AWS Lightsail).",
          "Improved development collaboration efficiency through API design and documentation automation.",
          "Optimized development and deployment speed by switching build tools from Maven to Gradle.",
          "Implemented KISA’s web firewall (Castle) and vulnerability assessment tool (Whistle).",
          "Improved stability and maintainability by transitioning from Crontab API calls to Spring Batch.",
          "Applied index tuning and table normalization, enhancing query execution speed and optimizing resource usage.",
          "Completely redeveloped Flask-based services into a Spring Boot / JPA environment.",
          "Optimized data retrieval performance through caching.",
          "Normalized inefficient table structures to eliminate duplicate data and ensure data integrity during migration.",
          "Applied domain-based packaging to improve core logic discovery speed and maintainability.",
          "Introduced a code review process within the organization, enhancing code quality and maintainability.",
          "Designed high-performance services through experience in developing gRPC and NestJS-based APIs.",
          "Optimized DevOps operations through experience with Blue-Green deployment strategies.",
          "Enhanced scalability by applying a Gradle-based multi-module architecture.",
          "Improved code readability and maintainability by separating domains based on DDD principles.",
          "Automated data migration to increase operational efficiency.",
          "Maintained security and reduced management costs through SSL certificate automation.",
          "Designed an event-driven asynchronous system.",
          "Experienced in building AOP-based logging systems.",
          "Applied API security measures and request rate-limiting strategies."
        ]
      },
      {
        "name": "Sallyplan Co., Ltd.",
        "points": [
          "Implemented data combination functionality using drag-and-drop in the EX-LIVE project and automated developer documentation.",
          "Executed remote commands via SSH in a Spring environment and integrated with APIs.",
          "Converted Vue.js-based drag-and-drop functionality to jQuery for cross-browser compatibility.",
          "Refactored code and optimized CSS to enhance IE compatibility."
        ]
      },
      {
        "name": "Septem Co., Ltd.",
        "points": [
          "Implemented UI/UX using Vue.js in the CX-LIVE project and enhanced user experience with dynamic components.",
          "Optimized data visualization and improved dashboard performance using Chart.js.",
          "Developed a web replay system and collected user behavior data using JavaScript."
        ]
      }    ]
  },
  "projects": {
    "description": "I am driven by curiosity and love taking on challenges. I have a passion for learning and enjoy exploring new knowledge.",
    "list": [
      {
        "name": "Excel Util",
        "description": "A library for reading and outputting Excel file data"
      },
      {
        "name": "Fc Bayern Fan Site",
        "description": "Built a soccer fan community site using the MVC model with Spring Boot framework"
      },
      {
        "name": "Job Information Site",
        "description": "Built a job information site using the MVC model with Spring framework"
      }
    ]
  }
}
