{
  "home": {
    "hello": {
      "prefix": "Hello, I am",
      "suffix": ""
    },
    "name": "Hanbong Bae",
    "position": "a Backend Developer.",
    "about": {
      "content": "I have honed diverse skills across various companies, enhancing my expertise in backend development.",
      "button": "Discover More"
    },
    "projects": {
      "content": "I have successfully spearheaded numerous projects with remarkable outcomes. Want to see the details?",
      "button": "View My Work"
    },
    "contact": {
      "content": "Looking for a developer or need help with a project? Let's get in touch!",
      "button": "Reach Out"
    }
  },
  "about": {
    "description": "I am a software developer with 5 years of experience specializing in backend web services within startup environments. I excel in backend API development using Spring Boot and managing Linux servers. Known for my rapid development and debugging skills, I consistently meet challenging deadlines and deliver reliable, high-quality results. My ability to adapt and grow in fast-paced environments, coupled with my continuous learning and deep understanding of the latest technological trends, enables me to effectively solve complex problems. My technical skill set includes Java, Spring, MySQL, AWS services, and Spring Batch, with a strong focus on SQL query optimization. I have successfully led multiple projects with agile project management and demonstrated my ability to work effectively in team environments.",
    "experience": "I have honed my skills working at various companies and collaborating with outstanding individuals.",
    "list": [
      {
        "name": "Wecruit Co., Ltd.",
        "points": [
          "Developed Excel Library: Utilized Apache POI to create a library providing Excel reading and writing functionalities.",
          "Created MAIL Library: Developed a library for reading and sending email templates using SMTP.",
          "Implemented Code Review Process: Introduced code review procedures to enhance code quality management efficiently.",
          "Built PDF Generation API with NestJS: Developed a PDF generation API leveraging the NestJS framework.",
          "Optimized PDF Generation Performance with gRPC: Enhanced PDF generation performance by integrating gRPC.",
          "Executed Blue-Green Deployment Using Shell Scripts: Applied Blue-Green deployment strategies and shell scripting to achieve zero-downtime deployments.",
          "Led Service Migration from Flask to Spring Boot: Migrated services from Flask to Spring Boot, improving system stability and scalability.",
          "Implemented Caching Mechanism: Applied caching to frequently unchanging data, enhancing read speeds and reducing server load.",
          "Upgraded Security with SSL OV Certificates: Enhanced system security by transitioning to SSL OV certificates.",
          "Adopted Event-Driven Architecture: Utilized SMS and MAIL event listeners to decouple business logic, improving system modularity.",
          "Implemented Logging with AOP: Employed Spring AOP to create detailed API access logs for better monitoring and debugging.",
          "Restricted Authentication Transmission Frequency: Applied Bucket4j to limit the number of authentication code transmissions per IP address.",
          "Automated Database Maintenance with Flyway: Integrated Flyway to automate database maintenance tasks.",
          "Consolidated Servers Using Apache2 vHosts: Deployed multiple services on a single server through Apache2 virtual hosts.",
          "Automated SSL Certificate Management: Migrated from Apache2 to Nginx, introduced Wildcard SSL, and implemented automated Let’s Encrypt SSL certificates via Nginx Proxy Manager.",
          "Optimized External APIs: Minimized business logic impact of external notification APIs by leveraging asynchronous @EventListener and WebClient, and implemented batch retry handling for failed sends.",
          "Implemented Automated Documentation: Utilized Spring Open API 3.0 to generate automated documentation, facilitating collaboration with front-end developers.",
          "Provided OpenAPI Services: Conducted stress testing for LG's recruitment system application, optimized connection pools, and eliminated deadlocks to ensure reliable OpenAPI services.",
          "Achieved Cost Efficiency: Strategically migrated from GCP to AWS LightSail, reducing server costs by 30%.",
          "Enhanced Database Performance: Improved query speeds by adding indexes and modifying Full Text Search strategies.",
          "Strengthened Security Measures: Introduced KISA's web firewall (Castle) and vulnerability assessment tool (Whistle) to bolster security.",
          "Improved Build Efficiency: Transitioned from Maven to Gradle, enabling selective builds and significantly reducing build times.",
          "Optimized Scheduling Processes: Replaced traditional Crontab shell scripts with Spring Batch, enhancing scheduling efficiency, preventing external access, and improving environment portability."
        ]
      },
      {
        "name": "Sallyplan Co., Ltd.",
        "points": [
          "Implemented drag-and-drop functionality for data combination and retrieval in the EX-LIVE project and wrote documentation for future developers",
          "Implemented SSH access and API in Spring",
          "Converted a project with drag-and-drop functionality written in Vue.js to jQuery",
          "Modified syntax and CSS for IE compatibility"
        ]
      },
      {
        "name": "Septem Co., Ltd.",
        "points": [
          "Implemented UI/UX using Vue.js in the CX-LIVE project",
          "Implemented various data statistics using Chart.js",
          "Collected user data using JavaScript for web replay"
        ]
      }
    ]
  },
  "projects": {
    "description": "I am driven by curiosity and love taking on challenges. I have a passion for learning and enjoy exploring new knowledge.",
    "list": [
      {
        "name": "Excel Util",
        "description": "A library for reading and outputting Excel file data"
      },
      {
        "name": "Fc Bayern Fan Site",
        "description": "Built a soccer fan community site using the MVC model with Spring Boot framework"
      },
      {
        "name": "Job Information Site",
        "description": "Built a job information site using the MVC model with Spring framework"
      }
    ]
  }
}
