{
  "home": {
    "hello": {
      "prefix": "안녕하세요, 저는",
      "suffix": "입니다"
    },
    "name": "배한봉",
    "position": "백엔드 개발자입니다.",
    "about": {
      "content": "여러 회사에서 일하며 다양한 기술을 습득했습니다",
      "button": "더 알아보기"
    },
    "projects": {
      "content": "여러 프로젝트를 성공적으로 이끌었습니다. 결과가 궁금하신가요?",
      "button": "포트폴리오 보기"
    },
    "contact": {
      "content": "프로젝트가 필요하시거나 개발자를 찾고 계신가요?",
      "button": "연락하기"
    }
  },
  "about": {
    "description": "Spring Boot 기반의 백엔드 개발 및 서버 운영을 담당하며, 24시간 안정적인 서비스 운영을 경험했습니다.\n백엔드 개발, 인프라 운영, 시스템 아키텍처 설계를 책임지며 서비스 확장과 최적화를 주도했습니다.\n특히, 기존 문서화 부족 및 사내 기술 리소스 한계를 극복하며, 문제를 해결하고 신규 기능을 개발하며 운영 효율성을 자율적으로 지속 개선했습니다.",
    "experience": "저는 여러 회사에서 일하면서 실력을 키웠으며 뛰어난 사람들과 함께 협력을 진행해왔습니다.",
    "list": [
      {
        "name": "(주)위크루트",
        "points": [
          "인도네시아 해외 서비스를 위해 Bean 기반 동적 구성 적용, 외부 API 호출을 유연하게 처리하고 비용 절감",
          "오픈 API 서비스의 안정성을 위해 부하 테스트 진행, Connection Pool 최적화 및 데드락 제거 적용",
          "트랜잭션 범위를 최소화하여 불필요한 사용을 줄이고, 성능 및 리소스 효율성을 개선",
          "Spring Batch Writer 변경을 통한 데이터 처리 속도 200% 향상",
          "비용 절감을 위한 클라우드 환경 이전 (GCP -> AWS Lightsail)",
          "API 설계 및 문서화 자동화를 통한 개발 협업 효율 증대",
          "빌드 도구를 Maven에서 Gradle로 개선하여 개발 및 배포 속도 최적화",
          "KISA의 웹 방화벽 (Castle) 및 취약점 평가 도구 (Whistle) 도입",
          "기존 Crontab API 호출 방식에서 Spring Batch로 전환하여 안정성 및 관리성 개선",
          "인덱스 튜닝 및 테이블 정규화 적용, 쿼리 실행 속도 향상 및 리소스 사용량 최적화",
          "Flask 기반 서비스를 SpringBoot / JPA 환경으로 전면 재개발",
          "캐시 적용을 통한 데이터 조회 성능 최적화",
          "비효율적인 테이블 구조를 정규화하여 중복 데이터를 제거하고, 데이터 정합성을 유지하면서 마이그레이션 수행",
          "관심사 단위 패키징 적용하여 핵심 로직 탐색 속도 및 유지보수성 향상",
          "코드 리뷰 프로세스를 조직 내 도입하며 코드 품질 및 유지보수성 강화",
          "gRPC 및 NestJS 기반 API 개발 경험을 통한 고성능 서비스 설계",
          "Blue-Green 배포 전략 적용 경험을 통한 DevOps 운영 최적화",
          "Gradle 기반 멀티 모듈 아키텍처를 적용하여 확장성을 강화",
          "DDD 원칙을 기반으로 도메인을 분리하여 코드 가독성과 유지보수성을 개선",
          "데이터 마이그레이션 자동화 및 운영 효율성 증대",
          "SSL 인증서 자동화를 통한 보안 유지 및 관리 비용 절감",
          "이벤트 기반 비동기 시스템 설계",
          "AOP 기반 로깅 시스템 구축 경험",
          "API 보안 및 인증 횟수 제한 전략 적용 경험"
        ]
      },
      {
        "name": "(주)샐리플랜",
        "points": [
          "EX-LIVE 프로젝트에서 드래그 앤 드롭을 통한 데이터 조합 기능 구현 및 개발자 문서화 자동화",
          "Spring 환경에서 SSH 접속을 통한 원격 명령 실행 및 API 통합",
          "Vue.js 기반 Drag&Drop 기능을 jQuery로 변환하여 크로스 브라우징 대응",
          "IE 호환성 강화를 위한 코드 리팩토링 및 CSS 최적화"
        ]
      },
      {
        "name": "(주)셉템",
        "points": [
          "CX-LIVE 프로젝트에서 Vue.js 기반 UI/UX 구현 및 동적 컴포넌트 적용을 통한 사용자 경험 개선",
          "Chart.js를 활용한 데이터 시각화 최적화 및 대시보드 성능 개선",
          "JavaScript 기반 사용자 행동 데이터 수집 및 웹 리플레이 시스템 구축"
        ]
      }
    ]
  },
  "projects": {
    "description": "\n저는 호기심을 바탕으로 도전하는 것을 좋아합니다.\n학습에 대한 열정이 있고, 항상 새로운 지식을 탐구하는 것을 즐깁니다.",
    "list": [
      {
        "name": "Excel Util",
        "description": "엑셀 파일 데이터 읽어 오거나 엑셀 출력하는 라이브러리"
      },
      {
        "name": "Fc Bayern 팬 사이트",
        "description": "스프링 부트 프레임워크를 이용한 mvc 모델 축구 팬 커뮤니티 사이트 구축"
      },
      {
        "name": "취업 정보 제공 사이트",
        "description": "스프링 프레임워크를 이용한 mvc 모델 취업 정보 제공 사이트 구축"
      }
    ]
  }
}
