{
  "home": {
    "hello": {
      "prefix": "안녕하세요, 저는",
      "suffix": "입니다"
    },
    "name": "배한봉",
    "position": "백엔드 개발자입니다.",
    "about": {
      "content": "여러 회사에서 일하며 다양한 기술을 습득했습니다",
      "button": "더 알아보기"
    },
    "projects": {
      "content": "여러 프로젝트를 성공적으로 이끌었습니다. 결과가 궁금하신가요?",
      "button": "포트폴리오 보기"
    },
    "contact": {
      "content": "프로젝트가 필요하시거나 개발자를 찾고 계신가요?",
      "button": "연락하기"
    }
  },
  "about": {
    "description": "스타트업 환경에서 5년간 백엔드 웹 서비스 분야의 경험을 쌓은 소프트웨어 개발자입니다. Spring Boot를 사용한 백엔드 API 개발과 리눅스 서버 관리에 능숙하며, 빠른\n개발과 디버깅 능력으로 까다로운 기한을 지속적으로 충족시켜 왔습니다. 신뢰할 수 있는 고품질의 성과를 제공하며, 빠르게 변화하는 환경에 적응하고 성장하는 능력이 뛰어납니다.\n                    지속적인 학습과 최신 기술 동향에 대한 깊은 이해로 복잡한 문제를 효과적으로 해결합니다. Java, Spring, MySQL, AWS 서비스, Spring Batch에 능숙하며,\nSQL 쿼리 최적화를 통해 포괄적인 기술 세트를 보여줍니다. 민첩한 프로젝트 관리로 여러 프로젝트를 성공적으로 이끌고 팀 환경에서 효과적으로 일하는 능력을 입증하였습니다.",
    "experience": "저는 여러 회사에서 일하면서 실력을 키웠으며 뛰어난 사람들과 함께 협력을 진행해왔습니다.",
    "list": [
      {
        "name": "(주)위크루트",
        "points": [
          "Excel 라이브러리: Apache POI를 활용하여 Excel 읽기 및 출력 기능을 제공하는 라이브러리 제작",
          "MAIL 라이브러리: SMTP 메일 사용 시 템플릿을 읽어 발송하는 라이브러리 제작",
          "코드 리뷰 프로세스 적용: 효율적인 코드 품질 관리를 위해 코드 리뷰 절차 도입",
          "NestJS 기반의 PDF 생성 API 작성: NestJS를 사용하여 PDF 생성 API 개발",
          "PDF 생성 시 gRPC 사용하여 성능 향상: gRPC를 도입하여 PDF 생성 성능 최적화",
          "쉘 스크립트를 활용한 Blue-Green 배포 적용: 무중단 배포를 위해 Blue-Green 배포 전략 및 쉘 스크립트 활용",
          "서비스 마이그레이션: Flask에서 Spring Boot로의 서비스 마이그레이션을 주도하여 시스템 안정성 및 확장성 향상",
          "캐시 적용: 자주 변하지 않는 데이터에 캐시를 적용하여 읽기 속도 향상 및 서버 부하 감소",
          "보안 업그레이드: SSL OV 인증서로 전환하여 보안 강화",
          "이벤트 기반 아키텍처: SMS 및 MAIL 이벤트 리스너를 활용하여 비즈니스 로직과의 분리 처리",
          "AOP를 활용한 로깅: Spring AOP를 구현하여 상세한 API 접근 로그 작성",
          "인증 전송 횟수 제한: Bucket4j를 적용하여 IP당 인증 번호 전송 횟수 제한",
          "데이터베이스 유지 관리: Flyway를 통합하여 DB 유지 관리 자동화",
          "서버 통합: Apache2 vhost를 사용하여 단일 서버에 여러 서비스 구현",
          "SSL 인증서 자동화: Apache2에서 Nginx로 마이그레이션하고, Wildcard SSL을 도입하여 Nginx Proxy Manager를 통해 Let’s Encrypt SSL 인증서 자동화 구현",
          "외부 API 최적화: 비동기 @EventListener와 WebClient를 활용하여 외부 알림용 API의 비즈니스 로직 영향 최소화 및 발송 실패 시 배치를 통한 재발송 처리",
          "자동 문서화: Spring Open API 3.0을 활용하여 Front-end 개발자들과의 협업을 위한 자동 문서화 구현",
          "오픈API 제공: LG 채용시스템 적용을 위한 스트레스 테스트 진행, 커넥션 풀 최적화 및 데드락 제거",
          "비용 효율적 해결책: GCP에서 AWS LightSail로의 전략적 마이그레이션을 통해 서버 비용 30% 절감",
          "성능 향상: 인덱스 추가 및 Full Text Search 전략 수정으로 쿼리 속도 개선",
          "보안 강화: KISA의 웹 방화벽(Castle) 및 취약점 평가 도구(Whistle) 도입",
          "빌드 과정의 효율성: Maven에서 Gradle로 전환하여 필요한 부분만 빌드하여 빌드 시간 대폭 단축",
          "최적화된 스케줄링: 전통적인 쉘 스크립트를 통한 Crontab 대신 Spring Batch를 도입하여 스케줄링 효율성 및 외부 접근 방지, 환경 이식성 향상"
        ]
      },
      {
        "name": "(주)샐리플랜",
        "points": [
          "EX-LIVE 프로젝트에서 드래그를 통해 데이터를 조합하고 가져와 제공하는 기능 구현 및 차후 개발자를 위한 문서 작성",
          "Spring에서 SSH 접속 및 API 구현",
          "Vue.js로 작성된 Drag&Drop 기능을 가진 프로젝트 jQuery로 변환",
          "프로젝트 IE 대응 위한 문법 변경 및 CSS 수정"
        ]
      },
      {
        "name": "(주)셉템",
        "points": [
          "CX-LIVE 프로젝트에서 Vue.js를 통한 UI/UX구현",
          "Chart.js 통한 다양한 데이터 통계 구현",
          "Javascript 활용하여 사용자 데이터 수집하여 웹상에서 리플레이 구현"
        ]
      }
    ]
  },
  "projects": {
    "description": "\n저는 호기심을 바탕으로 도전하는 것을 좋아합니다.\n학습에 대한 열정이 있고, 항상 새로운 지식을 탐구하는 것을 즐깁니다.",
    "list": [
      {
        "name": "Excel Util",
        "description": "엑셀 파일 데이터 읽어 오거나 엑셀 출력하는 라이브러리"
      },
      {
        "name": "Fc Bayern 팬 사이트",
        "description": "스프링 부트 프레임워크를 이용한 mvc 모델 축구 팬 커뮤니티 사이트 구축"
      },
      {
        "name": "취업 정보 제공 사이트",
        "description": "스프링 프레임워크를 이용한 mvc 모델 취업 정보 제공 사이트 구축"
      }
    ]
  }
}
